; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	spectrograph1 - mode
	infrared3 - mode
	spectrograph0 - mode
	image2 - mode
	Star5 - direction
	Star0 - direction
	Star4 - direction
	Star2 - direction
	Star3 - direction
	GroundStation1 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph0)
	(supports instrument1 image2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 spectrograph1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star0)
	(supports instrument4 image2)
	(supports instrument4 spectrograph1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument5 image2)
	(supports instrument5 infrared3)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star0)
	(supports instrument6 spectrograph0)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star3)
	(supports instrument7 spectrograph0)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star4)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star10)
	(supports instrument8 image2)
	(calibration_target instrument8 Star2)
	(calibration_target instrument8 Star4)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet13)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 Star3)
	(calibration_target instrument9 Star2)
	(supports instrument10 spectrograph1)
	(supports instrument10 spectrograph0)
	(calibration_target instrument10 GroundStation1)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star10)
)
(:goal (and
	(pointing satellite0 Star12)
	(pointing satellite4 Planet8)
	(have_image Phenomenon6 spectrograph0)
	(have_image Planet7 spectrograph0)
	(have_image Planet8 image2)
	(have_image Phenomenon9 image2)
	(have_image Star10 image2)
	(have_image Star11 spectrograph0)
	(have_image Star12 image2)
	(have_image Planet13 infrared3)
))

)

; plan
1. (turn_to satellite4 planet8 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 planet8)
   goals met: 1 of 10
2. (turn_to satellite1 groundstation1 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 10
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 10
4. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 1 of 10
5. (turn_to satellite1 planet7 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet7)
   goals met: 1 of 10
6. (take_image satellite1 planet7 instrument2 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 2 of 10
7. (turn_to satellite1 planet13 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet13)
   goals met: 2 of 10
8. (take_image satellite1 planet13 instrument2 infrared3)
   added: (have_image planet13 infrared3)
   goals met: 3 of 10
9. (turn_to satellite1 phenomenon6 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon6)
   goals met: 3 of 10
10. (turn_to satellite0 star2 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star2)
   goals met: 3 of 10
11. (take_image satellite1 phenomenon6 instrument2 spectrograph0)
   added: (have_image phenomenon6 spectrograph0)
   goals met: 4 of 10
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 10
13. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 4 of 10
14. (turn_to satellite0 phenomenon9 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 10
15. (take_image satellite0 phenomenon9 instrument1 image2)
   added: (have_image phenomenon9 image2)
   goals met: 5 of 10
16. (turn_to satellite0 planet8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet8)
   goals met: 5 of 10
17. (take_image satellite0 planet8 instrument1 image2)
   added: (have_image planet8 image2)
   goals met: 6 of 10
18. (turn_to satellite0 star10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star10)
   goals met: 6 of 10
19. (take_image satellite0 star10 instrument1 image2)
   added: (have_image star10 image2)
   goals met: 7 of 10
20. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 7 of 10
21. (take_image satellite0 star11 instrument1 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 8 of 10
22. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 9 of 10
23. (take_image satellite0 star12 instrument1 image2)
   added: (have_image star12 image2)
   goals met: 10 of 10
